{
   "description": "Fundamental Analysis (FA) is a holistic approach to study a business. This module will help you understand Equity research, read financial statements, annual reports, calculation of Financial Ratio, Analysis and most importantly evaluate the intrinsic value of a stock to find long-term investing opportunities.",
   "apple": [
      "Apple designs a wide variety of consumer electronic devices, including smartphones (iPhone), tablets (iPad), PCs (Mac), smartwatches (Apple Watch), AirPods, and TV boxes (Apple TV), among others. The iPhone makes up the majority of Apple’s total revenue.",
      "In addition, Apple offers its customers a variety of services such as Apple Music, iCloud, Apple Care, Apple TV+, Apple Arcade, Apple Card, and Apple Pay, among others. Apple's products run internally developed software and semiconductors, and the firm is well known for its integration of hardware,software and services.",
      "Apple's products are distributed online as well as through company-owned stores and third-party retailers. The company generates roughly 40% of its revenue from the Americas, with the remainder earned internationally.",
      "Apple Inc fundamentals help investors to digest information that contributes to Apple's financial success or failures. It also enables traders to predict the movement of Apple Stock.",
      "The fundamental analysis module provides a way to measure Apple's intrinsic value by examining its available economic and financial indicators, including the cash flow records, the balance sheet account changes, the income statement patterns, and various microeconomic indicators and financial ratios related to Apple stock. value of Apple Inc based on its technical analysis."
   ],
   "cocacola": [
      "Coca-Cola is currently regarded as number one stock in short ratio category among related companies. It is currently regarded as number one stock in beta category among related companies totaling about 0.26 of Beta per Short Ratio. The ratio of Short Ratio to Beta for Coca-Cola is roughly 3.81.",
      "Comparative valuation analysis is a catch-all model that can be used if you cannot value Coca Cola by discounting back its dividends or cash flows. This model doesn't attempt to find an intrinsic value for Coca Cola's Stock . Still, instead, it compares the stock's price multiples to a benchmark or nearest competition to determine if the stock is relatively undervalued or overvalued.",
      "The reason why the comparable model can be used in almost all circumstances is due to the vast number of multiples that can be utilized, such as the price-to-earnings (P/E), price-to-book (P/B), price-to-sales (P/S), price-to-cash flow (P/CF), and many others. The P/E ratio is the most commonly used of these ratios because it focuses on the Coca Cola's earnings, one of the primary drivers of an investment's value.",
      "Coca-Cola fundamentals help investors to digest information that contributes to Coca Cola's financial success or failures. It also enables traders to predict the movement of Coca Cola Stock.",
      "The fundamental analysis module provides a way to measure Coca Cola's intrinsic value by examining its available economic and financial indicators, including the cash flow records, the balance sheetaccount changes, the income statement patterns, and various microeconomic indicators and financial ratios related to Coca Cola stock."
   ],
   "tesla": [
      "Fundamental and technical analysis are two common ways to sort and pick stocks. How and when to use them can be a matter of personal style, but each has its strengths.",
      "Fundamental analysis attempts to identify stocks offering strong growth potential at a good price by examining the underlying company’s business, as well as conditions within its industry or in the broader economy. Investors have traditionally used fundamental analysis for longer-term trades, relying on metrics such as earnings per share, price-to-earnings ratio, price-to-earnings growth, and dividend yield.",
      "The big decline in price over the last few months for Tesla created some momentum for investors as it was traded today as low as 203.08 and as high as 223.8 per share. The company directors and management failed to add value to investors and position the company supply of money to exploit market volatility in October.",
      "However, diversifying your holdings with Tesla Inc or similar stocks can still protect your portfolios during high-volatility market scenarios. The stock standard deviation of daily returns for 90 days investing horizon is currently 3.17. The above-average risk is mostly attributed to market volatility and speculations regarding some of the upcoming earning calls from Tesla Inc partners."
   ],
   "johnson": [
      "Fundamental and technical analysis are two common ways to sort and pick stocks. How and when to use them can be a matter of personal style, but each has its strengths.",
      "Fundamental analysis attempts to identify stocks offering strong growth potential at a good price by examining the underlying company’s business, as well as conditions within its industry or in the broader economy. Investors have traditionally used fundamental analysis for longer-term trades, relying on metrics such as earnings per share, price-to-earnings ratio, price-to-earnings growth, and dividend yield.",
      "The recent indifference towards the small price fluctuations of Johnson Johnson may raise some interest from traders. The stock closed today at a share price of 171.48 on very low momentum in trading volume. The company directors and management did not add any value to Johnson Johnson investors in October.",
      "However, most investors can still diversify their portfolios with Johnson Johnson to hedge their inherited risk against high-volatility market scenarios. The stock standard deviation of daily returns for 90 days investing horizon is currently 1.06. The below-average Stock volatility is a good sign for longer-term investment options and for buy-and-hold investors."
   ]
}